program(1.0) {
    func main<ios15>(tensor<fp32, [1, 4]> bbox_xywh, tensor<fp32, [1, 3, 640, 480]> image_nchw) {
            tensor<int32, [1]> bbox_axes_0 = const()[name = tensor<string, []>("bbox_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<string, []> bbox_xywh_to_fp16_dtype_0 = const()[name = tensor<string, []>("bbox_xywh_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 4]> cast_518 = cast(dtype = bbox_xywh_to_fp16_dtype_0, x = bbox_xywh);
            tensor<fp16, [4]> bbox_cast = squeeze(axes = bbox_axes_0, x = cast_518);
            tensor<int32, []> var_21 = const()[name = tensor<string, []>("op_21"), val = tensor<int32, []>(0)];
            tensor<int32, [1]> var_22_axes_0 = const()[name = tensor<string, []>("op_22_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<string, []> image_nchw_to_fp16_dtype_0 = const()[name = tensor<string, []>("image_nchw_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 3, 640, 480]> cast_516 = cast(dtype = image_nchw_to_fp16_dtype_0, x = image_nchw);
            tensor<fp16, [3, 640, 480]> var_22_cast = squeeze(axes = var_22_axes_0, x = cast_516);
            tensor<int32, [1]> var_24_begin_0 = const()[name = tensor<string, []>("op_24_begin_0"), val = tensor<int32, [1]>([0])];
            tensor<int32, [1]> var_24_end_0 = const()[name = tensor<string, []>("op_24_end_0"), val = tensor<int32, [1]>([4])];
            tensor<bool, [1]> var_24_end_mask_0 = const()[name = tensor<string, []>("op_24_end_mask_0"), val = tensor<bool, [1]>([true])];
            tensor<int32, [1]> var_24_stride_0 = const()[name = tensor<string, []>("op_24_stride_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [2]> var_24_cast = slice_by_index(begin = var_24_begin_0, end = var_24_end_0, end_mask = var_24_end_mask_0, stride = var_24_stride_0, x = bbox_cast);
            tensor<bool, []> center_x_keep_dims_0 = const()[name = tensor<string, []>("center_x_keep_dims_0"), val = tensor<bool, []>(false)];
            tensor<fp16, []> center_x_cast = reduce_mean(keep_dims = center_x_keep_dims_0, x = var_24_cast);
            tensor<int32, [1]> var_26_begin_0 = const()[name = tensor<string, []>("op_26_begin_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> var_26_end_0 = const()[name = tensor<string, []>("op_26_end_0"), val = tensor<int32, [1]>([4])];
            tensor<bool, [1]> var_26_end_mask_0 = const()[name = tensor<string, []>("op_26_end_mask_0"), val = tensor<bool, [1]>([true])];
            tensor<int32, [1]> var_26_stride_0 = const()[name = tensor<string, []>("op_26_stride_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [2]> var_26_cast = slice_by_index(begin = var_26_begin_0, end = var_26_end_0, end_mask = var_26_end_mask_0, stride = var_26_stride_0, x = bbox_cast);
            tensor<bool, []> center_y_keep_dims_0 = const()[name = tensor<string, []>("center_y_keep_dims_0"), val = tensor<bool, []>(false)];
            tensor<fp16, []> center_y_cast = reduce_mean(keep_dims = center_y_keep_dims_0, x = var_26_cast);
            tensor<int32, [1]> w_1_begin_0 = const()[name = tensor<string, []>("w_1_begin_0"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1]> w_1_end_0 = const()[name = tensor<string, []>("w_1_end_0"), val = tensor<int32, [1]>([3])];
            tensor<bool, [1]> w_1_end_mask_0 = const()[name = tensor<string, []>("w_1_end_mask_0"), val = tensor<bool, [1]>([false])];
            tensor<bool, [1]> w_1_squeeze_mask_0 = const()[name = tensor<string, []>("w_1_squeeze_mask_0"), val = tensor<bool, [1]>([true])];
            tensor<fp16, []> w_1_cast = slice_by_index(begin = w_1_begin_0, end = w_1_end_0, end_mask = w_1_end_mask_0, squeeze_mask = w_1_squeeze_mask_0, x = bbox_cast);
            tensor<int32, [1]> h_1_begin_0 = const()[name = tensor<string, []>("h_1_begin_0"), val = tensor<int32, [1]>([3])];
            tensor<int32, [1]> h_1_end_0 = const()[name = tensor<string, []>("h_1_end_0"), val = tensor<int32, [1]>([4])];
            tensor<bool, [1]> h_1_end_mask_0 = const()[name = tensor<string, []>("h_1_end_mask_0"), val = tensor<bool, [1]>([false])];
            tensor<bool, [1]> h_1_squeeze_mask_0 = const()[name = tensor<string, []>("h_1_squeeze_mask_0"), val = tensor<bool, [1]>([true])];
            tensor<fp16, []> h_1_cast = slice_by_index(begin = h_1_begin_0, end = h_1_end_0, end_mask = h_1_end_mask_0, squeeze_mask = h_1_squeeze_mask_0, x = bbox_cast);
            tensor<fp16, []> _inversed_31_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_31_y_0_to_fp16"), val = tensor<fp16, []>(0x1.554p+0)];
            tensor<fp16, []> _inversed_31_cast = mul(x = w_1_cast, y = _inversed_31_y_0_to_fp16);
            tensor<fp16, []> h_cast = maximum(x = _inversed_31_cast, y = h_1_cast);
            tensor<fp16, []> var_33_to_fp16 = const()[name = tensor<string, []>("op_33_to_fp16"), val = tensor<fp16, []>(0x1.8p-1)];
            tensor<fp16, []> var_34_cast = mul(x = h_cast, y = var_33_to_fp16);
            tensor<fp16, []> w_cast = maximum(x = var_34_cast, y = w_1_cast);
            tensor<fp16, [2]> var_37_cast = stack(axis = var_21, values = (w_cast, h_cast));
            tensor<fp16, []> _inversed_scale_1_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_scale_1_y_0_to_fp16"), val = tensor<fp16, []>(0x1.47cp-8)];
            tensor<fp16, [2]> _inversed_scale_1_cast = mul(x = var_37_cast, y = _inversed_scale_1_y_0_to_fp16);
            tensor<fp16, []> var_17_to_fp16 = const()[name = tensor<string, []>("op_17_to_fp16"), val = tensor<fp16, []>(0x1.4p+0)];
            tensor<fp16, [2]> scale_3_cast = mul(x = _inversed_scale_1_cast, y = var_17_to_fp16);
            tensor<fp16, []> var_50_y_0_promoted = const()[name = tensor<string, []>("op_50_y_0_promoted"), val = tensor<fp16, []>(-0x1p+0)];
            tensor<fp16, []> var_50_cast = mul(x = center_x_cast, y = var_50_y_0_promoted);
            tensor<fp16, []> var_49_to_fp16 = const()[name = tensor<string, []>("op_49_to_fp16"), val = tensor<fp16, []>(0x1.ep+7)];
            tensor<fp16, []> dx_3_cast = add(x = var_50_cast, y = var_49_to_fp16);
            tensor<fp16, []> var_53_y_0_promoted = const()[name = tensor<string, []>("op_53_y_0_promoted"), val = tensor<fp16, []>(-0x1p+0)];
            tensor<fp16, []> var_53_cast = mul(x = center_y_cast, y = var_53_y_0_promoted);
            tensor<fp16, []> var_52_to_fp16 = const()[name = tensor<string, []>("op_52_to_fp16"), val = tensor<fp16, []>(0x1.4p+8)];
            tensor<fp16, []> dy_3_cast = add(x = var_53_cast, y = var_52_to_fp16);
            tensor<bool, []> s_1_keep_dims_0 = const()[name = tensor<string, []>("s_1_keep_dims_0"), val = tensor<bool, []>(false)];
            tensor<fp16, []> s_1_cast = reduce_min(keep_dims = s_1_keep_dims_0, x = scale_3_cast);
            tensor<fp16, []> var_10_promoted = const()[name = tensor<string, []>("op_10_promoted"), val = tensor<fp16, []>(-0x1p+1)];
            tensor<fp16, []> var_56_cast = mul(x = dx_3_cast, y = var_10_promoted);
            tensor<fp16, []> _inversed_px_1_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_px_1_y_0_to_fp16"), val = tensor<fp16, []>(0x1.11p-9)];
            tensor<fp16, []> _inversed_px_1_cast = mul(x = var_56_cast, y = _inversed_px_1_y_0_to_fp16);
            tensor<fp16, []> var_10_promoted_0 = const()[name = tensor<string, []>("op_10_promoted_0"), val = tensor<fp16, []>(-0x1p+1)];
            tensor<fp16, []> var_58_cast = mul(x = dy_3_cast, y = var_10_promoted_0);
            tensor<fp16, []> _inversed_py_1_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_py_1_y_0_to_fp16"), val = tensor<fp16, []>(0x1.998p-10)];
            tensor<fp16, []> _inversed_py_1_cast = mul(x = var_58_cast, y = _inversed_py_1_y_0_to_fp16);
            tensor<fp16, []> var_61_to_fp16 = const()[name = tensor<string, []>("op_61_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [3]> top_row_1_cast = stack(axis = var_21, values = (s_1_cast, var_61_to_fp16, _inversed_px_1_cast));
            tensor<fp16, []> var_65_to_fp16 = const()[name = tensor<string, []>("op_65_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [3]> bottom_row_1_cast = stack(axis = var_21, values = (var_65_to_fp16, s_1_cast, _inversed_py_1_cast));
            tensor<fp16, [2, 3]> T_cast = stack(axis = var_21, values = (top_row_1_cast, bottom_row_1_cast));
            tensor<int32, [1]> theta_axes_0 = const()[name = tensor<string, []>("theta_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp16, [1, 2, 3]> theta_cast = expand_dims(axes = theta_axes_0, x = T_cast);
            tensor<int32, [1]> img_5_axes_0 = const()[name = tensor<string, []>("img_5_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp16, [1, 3, 640, 480]> img_5_cast = expand_dims(axes = img_5_axes_0, x = var_22_cast);
            tensor<int32, [2]> var_78_theta_reshape_shape_0 = const()[name = tensor<string, []>("op_78_theta_reshape_shape_0"), val = tensor<int32, [2]>([-1, 6])];
            tensor<fp16, [1, 6]> var_78_theta_reshape_cast = reshape(shape = var_78_theta_reshape_shape_0, x = theta_cast);
            tensor<int32, []> var_78_output_height_0 = const()[name = tensor<string, []>("op_78_output_height_0"), val = tensor<int32, []>(640)];
            tensor<int32, []> var_78_output_width_0 = const()[name = tensor<string, []>("op_78_output_width_0"), val = tensor<int32, []>(480)];
            tensor<string, []> var_78_sampling_mode_0 = const()[name = tensor<string, []>("op_78_sampling_mode_0"), val = tensor<string, []>("bilinear")];
            tensor<string, []> var_78_padding_mode_0 = const()[name = tensor<string, []>("op_78_padding_mode_0"), val = tensor<string, []>("constant")];
            tensor<string, []> var_78_coordinates_mode_0 = const()[name = tensor<string, []>("op_78_coordinates_mode_0"), val = tensor<string, []>("normalized_minus_one_to_one")];
            tensor<bool, []> var_78_align_corners_0 = const()[name = tensor<string, []>("op_78_align_corners_0"), val = tensor<bool, []>(false)];
            tensor<fp16, []> var_78_padding_value_0_to_fp16 = const()[name = tensor<string, []>("op_78_padding_value_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 3, 640, 480]> var_78_cast = affine(align_corners = var_78_align_corners_0, coordinates_mode = var_78_coordinates_mode_0, output_height = var_78_output_height_0, output_width = var_78_output_width_0, padding_mode = var_78_padding_mode_0, padding_value = var_78_padding_value_0_to_fp16, sampling_mode = var_78_sampling_mode_0, transform_matrix = var_78_theta_reshape_cast, x = img_5_cast);
            tensor<int32, [1]> result_1_axes_0 = const()[name = tensor<string, []>("result_1_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp16, [3, 640, 480]> result_1_cast = squeeze(axes = result_1_axes_0, x = var_78_cast);
            tensor<int32, [3]> var_105_begin_0 = const()[name = tensor<string, []>("op_105_begin_0"), val = tensor<int32, [3]>([0, 192, 0])];
            tensor<int32, [3]> var_105_end_0 = const()[name = tensor<string, []>("op_105_end_0"), val = tensor<int32, [3]>([3, 448, 480])];
            tensor<bool, [3]> var_105_end_mask_0 = const()[name = tensor<string, []>("op_105_end_mask_0"), val = tensor<bool, [3]>([true, false, true])];
            tensor<fp16, [3, 256, 480]> var_105_cast = slice_by_index(begin = var_105_begin_0, end = var_105_end_0, end_mask = var_105_end_mask_0, x = result_1_cast);
            tensor<int32, [3]> result_begin_0 = const()[name = tensor<string, []>("result_begin_0"), val = tensor<int32, [3]>([0, 0, 144])];
            tensor<int32, [3]> result_end_0 = const()[name = tensor<string, []>("result_end_0"), val = tensor<int32, [3]>([3, 256, 336])];
            tensor<bool, [3]> result_end_mask_0 = const()[name = tensor<string, []>("result_end_mask_0"), val = tensor<bool, [3]>([true, true, false])];
            tensor<fp16, [3, 256, 192]> result_cast = slice_by_index(begin = result_begin_0, end = result_end_0, end_mask = result_end_mask_0, x = var_105_cast);
            tensor<int32, [1]> var_107 = const()[name = tensor<string, []>("op_107"), val = tensor<int32, [1]>([0])];
            tensor<fp16, [3, 256, 192]> img_cast = reverse(axes = var_107, x = result_cast);
            tensor<fp16, []> _inversed_tensor_1_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_tensor_1_y_0_to_fp16"), val = tensor<fp16, []>(0x1.01p-8)];
            tensor<fp16, [3, 256, 192]> _inversed_tensor_1_cast = mul(x = img_cast, y = _inversed_tensor_1_y_0_to_fp16);
            tensor<fp16, [3, 1, 1]> mean_to_fp16 = const()[name = tensor<string, []>("mean_to_fp16"), val = tensor<fp16, [3, 1, 1]>([[[0x1.f0cp-2]], [[0x1.d3p-2]], [[0x1.9fcp-2]]])];
            tensor<fp16, [3, 256, 192]> tensor_cast = sub(x = _inversed_tensor_1_cast, y = mean_to_fp16);
            tensor<fp16, [3, 1, 1]> _inversed_feats_1_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_feats_1_y_0_to_fp16"), val = tensor<fp16, [3, 1, 1]>([[[0x1.178p+2]], [[0x1.1dcp+2]], [[0x1.1c8p+2]]])];
            tensor<fp16, [3, 256, 192]> _inversed_feats_1_cast = mul(x = tensor_cast, y = _inversed_feats_1_y_0_to_fp16);
            tensor<int32, [1]> feats_axes_0 = const()[name = tensor<string, []>("feats_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp16, [1, 3, 256, 192]> feats_cast = expand_dims(axes = feats_axes_0, x = _inversed_feats_1_cast);
            tensor<int32, [1]> scale_axes_0 = const()[name = tensor<string, []>("scale_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp16, [1, 2]> scale_cast = expand_dims(axes = scale_axes_0, x = scale_3_cast);
            tensor<int32, []> var_133 = const()[name = tensor<string, []>("op_133"), val = tensor<int32, []>(1)];
            tensor<int32, []> var_135 = const()[name = tensor<string, []>("op_135"), val = tensor<int32, []>(2)];
            tensor<int32, []> var_137 = const()[name = tensor<string, []>("op_137"), val = tensor<int32, []>(16)];
            tensor<int32, [2]> var_151 = const()[name = tensor<string, []>("op_151"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_153 = const()[name = tensor<string, []>("op_153"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [4]>([3, 3, 3, 3])];
            tensor<fp16, [48, 3, 7, 7]> pose_model_backbone_conv1_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_conv1_weight_to_fp16"), val = tensor<fp16, [48, 3, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [48]> pose_model_backbone_conv1_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_conv1_bias_to_fp16"), val = tensor<fp16, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14272)))];
            tensor<fp16, [1, 48, 128, 96]> input_1_cast = conv(bias = pose_model_backbone_conv1_bias_to_fp16, dilations = var_153, groups = var_133, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = var_151, weight = pose_model_backbone_conv1_weight_to_fp16, x = feats_cast);
            tensor<fp16, [1, 48, 128, 96]> input_3_cast = relu(x = input_1_cast);
            tensor<int32, [2]> var_157 = const()[name = tensor<string, []>("op_157"), val = tensor<int32, [2]>([3, 3])];
            tensor<int32, [2]> var_158 = const()[name = tensor<string, []>("op_158"), val = tensor<int32, [2]>([2, 2])];
            tensor<string, []> input_5_pad_type_0 = const()[name = tensor<string, []>("input_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_5_pad_0 = const()[name = tensor<string, []>("input_5_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<bool, []> input_5_ceil_mode_0 = const()[name = tensor<string, []>("input_5_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 48, 64, 48]> input_5_cast = max_pool(ceil_mode = input_5_ceil_mode_0, kernel_sizes = var_157, pad = input_5_pad_0, pad_type = input_5_pad_type_0, strides = var_158, x = input_3_cast);
            tensor<int32, [2]> var_173 = const()[name = tensor<string, []>("op_173"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_175 = const()[name = tensor<string, []>("op_175"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_7_pad_type_0 = const()[name = tensor<string, []>("input_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_7_pad_0 = const()[name = tensor<string, []>("input_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [80, 48, 1, 1]> pose_model_backbone_layer1_0_conv1_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_0_conv1_weight_to_fp16"), val = tensor<fp16, [80, 48, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14464)))];
            tensor<fp16, [80]> pose_model_backbone_layer1_0_conv1_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_0_conv1_bias_to_fp16"), val = tensor<fp16, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22208)))];
            tensor<fp16, [1, 80, 64, 48]> input_7_cast = conv(bias = pose_model_backbone_layer1_0_conv1_bias_to_fp16, dilations = var_175, groups = var_133, pad = input_7_pad_0, pad_type = input_7_pad_type_0, strides = var_173, weight = pose_model_backbone_layer1_0_conv1_weight_to_fp16, x = input_5_cast);
            tensor<fp16, [1, 80, 64, 48]> input_9_cast = relu(x = input_7_cast);
            tensor<int32, [2]> var_181 = const()[name = tensor<string, []>("op_181"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_183 = const()[name = tensor<string, []>("op_183"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_11_pad_type_0 = const()[name = tensor<string, []>("input_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_11_pad_0 = const()[name = tensor<string, []>("input_11_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [80, 5, 3, 3]> pose_model_backbone_layer1_0_conv2_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_0_conv2_weight_to_fp16"), val = tensor<fp16, [80, 5, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22464)))];
            tensor<fp16, [80]> pose_model_backbone_layer1_0_conv2_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_0_conv2_bias_to_fp16"), val = tensor<fp16, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29760)))];
            tensor<fp16, [1, 80, 64, 48]> input_11_cast = conv(bias = pose_model_backbone_layer1_0_conv2_bias_to_fp16, dilations = var_183, groups = var_137, pad = input_11_pad_0, pad_type = input_11_pad_type_0, strides = var_181, weight = pose_model_backbone_layer1_0_conv2_weight_to_fp16, x = input_9_cast);
            tensor<fp16, [1, 80, 64, 48]> input_13_cast = relu(x = input_11_cast);
            tensor<int32, [2]> var_189 = const()[name = tensor<string, []>("op_189"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_191 = const()[name = tensor<string, []>("op_191"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_1_pad_type_0 = const()[name = tensor<string, []>("x_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_1_pad_0 = const()[name = tensor<string, []>("x_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [80, 80, 1, 1]> pose_model_backbone_layer1_0_conv3_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_0_conv3_weight_to_fp16"), val = tensor<fp16, [80, 80, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30016)))];
            tensor<fp16, [80]> pose_model_backbone_layer1_0_conv3_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_0_conv3_bias_to_fp16"), val = tensor<fp16, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42880)))];
            tensor<fp16, [1, 80, 64, 48]> x_1_cast = conv(bias = pose_model_backbone_layer1_0_conv3_bias_to_fp16, dilations = var_191, groups = var_133, pad = x_1_pad_0, pad_type = x_1_pad_type_0, strides = var_189, weight = pose_model_backbone_layer1_0_conv3_weight_to_fp16, x = input_13_cast);
            tensor<int32, [3]> var_204 = const()[name = tensor<string, []>("op_204"), val = tensor<int32, [3]>([1, 80, 3072])];
            tensor<fp16, [1, 80, 3072]> input_x_1_cast = reshape(shape = var_204, x = x_1_cast);
            tensor<int32, [1]> input_x_3_axes_0 = const()[name = tensor<string, []>("input_x_3_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 80, 3072]> input_x_3_cast = expand_dims(axes = input_x_3_axes_0, x = input_x_1_cast);
            tensor<int32, [2]> var_209 = const()[name = tensor<string, []>("op_209"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_211 = const()[name = tensor<string, []>("op_211"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> context_mask_1_pad_type_0 = const()[name = tensor<string, []>("context_mask_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> context_mask_1_pad_0 = const()[name = tensor<string, []>("context_mask_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1, 80, 1, 1]> pose_model_backbone_layer1_0_attention_conv_mask_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_0_attention_conv_mask_weight_to_fp16"), val = tensor<fp16, [1, 80, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43136)))];
            tensor<fp16, [1]> pose_model_backbone_layer1_0_attention_conv_mask_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_0_attention_conv_mask_bias_to_fp16"), val = tensor<fp16, [1]>([-0x1.8p-23])];
            tensor<fp16, [1, 1, 64, 48]> context_mask_1_cast = conv(bias = pose_model_backbone_layer1_0_attention_conv_mask_bias_to_fp16, dilations = var_211, groups = var_133, pad = context_mask_1_pad_0, pad_type = context_mask_1_pad_type_0, strides = var_209, weight = pose_model_backbone_layer1_0_attention_conv_mask_weight_to_fp16, x = x_1_cast);
            tensor<int32, [3]> var_216 = const()[name = tensor<string, []>("op_216"), val = tensor<int32, [3]>([1, 1, 3072])];
            tensor<fp16, [1, 1, 3072]> input_15_cast = reshape(shape = var_216, x = context_mask_1_cast);
            tensor<fp16, [1, 1, 3072]> context_mask_3_cast = softmax(axis = var_135, x = input_15_cast);
            tensor<int32, [1]> context_mask_5_axes_0 = const()[name = tensor<string, []>("context_mask_5_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 1, 3072, 1]> context_mask_5_cast = expand_dims(axes = context_mask_5_axes_0, x = context_mask_3_cast);
            tensor<bool, []> context_1_transpose_x_0 = const()[name = tensor<string, []>("context_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> context_1_transpose_y_0 = const()[name = tensor<string, []>("context_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 1, 80, 1]> context_1_cast = matmul(transpose_x = context_1_transpose_x_0, transpose_y = context_1_transpose_y_0, x = input_x_3_cast, y = context_mask_5_cast);
            tensor<int32, [4]> var_221 = const()[name = tensor<string, []>("op_221"), val = tensor<int32, [4]>([1, 80, 1, 1])];
            tensor<fp16, [1, 80, 1, 1]> input_17_cast = reshape(shape = var_221, x = context_1_cast);
            tensor<int32, [2]> var_228 = const()[name = tensor<string, []>("op_228"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_230 = const()[name = tensor<string, []>("op_230"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_19_pad_type_0 = const()[name = tensor<string, []>("input_19_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_19_pad_0 = const()[name = tensor<string, []>("input_19_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 80, 1, 1]> pose_model_backbone_layer1_0_attention_channel_add_conv_0_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_0_attention_channel_add_conv_0_weight_to_fp16"), val = tensor<fp16, [16, 80, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(43392)))];
            tensor<fp16, [16]> pose_model_backbone_layer1_0_attention_channel_add_conv_0_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_0_attention_channel_add_conv_0_bias_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46016)))];
            tensor<fp16, [1, 16, 1, 1]> input_19_cast = conv(bias = pose_model_backbone_layer1_0_attention_channel_add_conv_0_bias_to_fp16, dilations = var_230, groups = var_133, pad = input_19_pad_0, pad_type = input_19_pad_type_0, strides = var_228, weight = pose_model_backbone_layer1_0_attention_channel_add_conv_0_weight_to_fp16, x = input_17_cast);
            tensor<int32, [3]> input_21_axes_0 = const()[name = tensor<string, []>("input_21_axes_0"), val = tensor<int32, [3]>([-3, -2, -1])];
            tensor<fp16, [16, 1, 1]> pose_model_backbone_layer1_0_attention_channel_add_conv_1_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_0_attention_channel_add_conv_1_weight_to_fp16"), val = tensor<fp16, [16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46144)))];
            tensor<fp16, [16, 1, 1]> pose_model_backbone_layer1_0_attention_channel_add_conv_1_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_0_attention_channel_add_conv_1_bias_to_fp16"), val = tensor<fp16, [16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46272)))];
            tensor<fp16, []> var_138_to_fp16 = const()[name = tensor<string, []>("op_138_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 16, 1, 1]> input_21_cast = layer_norm(axes = input_21_axes_0, beta = pose_model_backbone_layer1_0_attention_channel_add_conv_1_bias_to_fp16, epsilon = var_138_to_fp16, gamma = pose_model_backbone_layer1_0_attention_channel_add_conv_1_weight_to_fp16, x = input_19_cast);
            tensor<fp16, [1, 16, 1, 1]> input_23_cast = relu(x = input_21_cast);
            tensor<int32, [2]> var_240 = const()[name = tensor<string, []>("op_240"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_242 = const()[name = tensor<string, []>("op_242"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> channel_add_term_1_pad_type_0 = const()[name = tensor<string, []>("channel_add_term_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> channel_add_term_1_pad_0 = const()[name = tensor<string, []>("channel_add_term_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [80, 16, 1, 1]> pose_model_backbone_layer1_0_attention_channel_add_conv_3_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_0_attention_channel_add_conv_3_weight_to_fp16"), val = tensor<fp16, [80, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46400)))];
            tensor<fp16, [80]> pose_model_backbone_layer1_0_attention_channel_add_conv_3_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_0_attention_channel_add_conv_3_bias_to_fp16"), val = tensor<fp16, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(49024)))];
            tensor<fp16, [1, 80, 1, 1]> channel_add_term_1_cast = conv(bias = pose_model_backbone_layer1_0_attention_channel_add_conv_3_bias_to_fp16, dilations = var_242, groups = var_133, pad = channel_add_term_1_pad_0, pad_type = channel_add_term_1_pad_type_0, strides = var_240, weight = pose_model_backbone_layer1_0_attention_channel_add_conv_3_weight_to_fp16, x = input_23_cast);
            tensor<fp16, [1, 80, 64, 48]> out_1_cast = add(x = x_1_cast, y = channel_add_term_1_cast);
            tensor<int32, [2]> var_249 = const()[name = tensor<string, []>("op_249"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_251 = const()[name = tensor<string, []>("op_251"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> identity_1_pad_type_0 = const()[name = tensor<string, []>("identity_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> identity_1_pad_0 = const()[name = tensor<string, []>("identity_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [80, 48, 1, 1]> pose_model_backbone_layer1_0_downsample_0_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_0_downsample_0_weight_to_fp16"), val = tensor<fp16, [80, 48, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(49280)))];
            tensor<fp16, [80]> pose_model_backbone_layer1_0_downsample_0_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_0_downsample_0_bias_to_fp16"), val = tensor<fp16, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(57024)))];
            tensor<fp16, [1, 80, 64, 48]> identity_1_cast = conv(bias = pose_model_backbone_layer1_0_downsample_0_bias_to_fp16, dilations = var_251, groups = var_133, pad = identity_1_pad_0, pad_type = identity_1_pad_type_0, strides = var_249, weight = pose_model_backbone_layer1_0_downsample_0_weight_to_fp16, x = input_5_cast);
            tensor<fp16, [1, 80, 64, 48]> input_25_cast = add(x = out_1_cast, y = identity_1_cast);
            tensor<fp16, [1, 80, 64, 48]> input_27_cast = relu(x = input_25_cast);
            tensor<int32, [2]> var_262 = const()[name = tensor<string, []>("op_262"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_264 = const()[name = tensor<string, []>("op_264"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_29_pad_type_0 = const()[name = tensor<string, []>("input_29_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_29_pad_0 = const()[name = tensor<string, []>("input_29_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [80, 80, 1, 1]> pose_model_backbone_layer1_1_conv1_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_1_conv1_weight_to_fp16"), val = tensor<fp16, [80, 80, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(57280)))];
            tensor<fp16, [80]> pose_model_backbone_layer1_1_conv1_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_1_conv1_bias_to_fp16"), val = tensor<fp16, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(70144)))];
            tensor<fp16, [1, 80, 64, 48]> input_29_cast = conv(bias = pose_model_backbone_layer1_1_conv1_bias_to_fp16, dilations = var_264, groups = var_133, pad = input_29_pad_0, pad_type = input_29_pad_type_0, strides = var_262, weight = pose_model_backbone_layer1_1_conv1_weight_to_fp16, x = input_27_cast);
            tensor<fp16, [1, 80, 64, 48]> input_31_cast = relu(x = input_29_cast);
            tensor<int32, [2]> var_270 = const()[name = tensor<string, []>("op_270"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_272 = const()[name = tensor<string, []>("op_272"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_33_pad_type_0 = const()[name = tensor<string, []>("input_33_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_33_pad_0 = const()[name = tensor<string, []>("input_33_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [80, 5, 3, 3]> pose_model_backbone_layer1_1_conv2_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_1_conv2_weight_to_fp16"), val = tensor<fp16, [80, 5, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(70400)))];
            tensor<fp16, [80]> pose_model_backbone_layer1_1_conv2_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_1_conv2_bias_to_fp16"), val = tensor<fp16, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77696)))];
            tensor<fp16, [1, 80, 64, 48]> input_33_cast = conv(bias = pose_model_backbone_layer1_1_conv2_bias_to_fp16, dilations = var_272, groups = var_137, pad = input_33_pad_0, pad_type = input_33_pad_type_0, strides = var_270, weight = pose_model_backbone_layer1_1_conv2_weight_to_fp16, x = input_31_cast);
            tensor<fp16, [1, 80, 64, 48]> input_35_cast = relu(x = input_33_cast);
            tensor<int32, [2]> var_278 = const()[name = tensor<string, []>("op_278"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_280 = const()[name = tensor<string, []>("op_280"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_3_pad_type_0 = const()[name = tensor<string, []>("x_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_3_pad_0 = const()[name = tensor<string, []>("x_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [80, 80, 1, 1]> pose_model_backbone_layer1_1_conv3_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_1_conv3_weight_to_fp16"), val = tensor<fp16, [80, 80, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(77952)))];
            tensor<fp16, [80]> pose_model_backbone_layer1_1_conv3_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_1_conv3_bias_to_fp16"), val = tensor<fp16, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(90816)))];
            tensor<fp16, [1, 80, 64, 48]> x_3_cast = conv(bias = pose_model_backbone_layer1_1_conv3_bias_to_fp16, dilations = var_280, groups = var_133, pad = x_3_pad_0, pad_type = x_3_pad_type_0, strides = var_278, weight = pose_model_backbone_layer1_1_conv3_weight_to_fp16, x = input_35_cast);
            tensor<int32, [3]> var_293 = const()[name = tensor<string, []>("op_293"), val = tensor<int32, [3]>([1, 80, 3072])];
            tensor<fp16, [1, 80, 3072]> input_x_5_cast = reshape(shape = var_293, x = x_3_cast);
            tensor<int32, [1]> input_x_7_axes_0 = const()[name = tensor<string, []>("input_x_7_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 80, 3072]> input_x_7_cast = expand_dims(axes = input_x_7_axes_0, x = input_x_5_cast);
            tensor<int32, [2]> var_298 = const()[name = tensor<string, []>("op_298"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_300 = const()[name = tensor<string, []>("op_300"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> context_mask_7_pad_type_0 = const()[name = tensor<string, []>("context_mask_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> context_mask_7_pad_0 = const()[name = tensor<string, []>("context_mask_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1, 80, 1, 1]> pose_model_backbone_layer1_1_attention_conv_mask_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_1_attention_conv_mask_weight_to_fp16"), val = tensor<fp16, [1, 80, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(91072)))];
            tensor<fp16, [1]> pose_model_backbone_layer1_1_attention_conv_mask_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_1_attention_conv_mask_bias_to_fp16"), val = tensor<fp16, [1]>([-0x1.7p-20])];
            tensor<fp16, [1, 1, 64, 48]> context_mask_7_cast = conv(bias = pose_model_backbone_layer1_1_attention_conv_mask_bias_to_fp16, dilations = var_300, groups = var_133, pad = context_mask_7_pad_0, pad_type = context_mask_7_pad_type_0, strides = var_298, weight = pose_model_backbone_layer1_1_attention_conv_mask_weight_to_fp16, x = x_3_cast);
            tensor<int32, [3]> var_305 = const()[name = tensor<string, []>("op_305"), val = tensor<int32, [3]>([1, 1, 3072])];
            tensor<fp16, [1, 1, 3072]> input_37_cast = reshape(shape = var_305, x = context_mask_7_cast);
            tensor<fp16, [1, 1, 3072]> context_mask_9_cast = softmax(axis = var_135, x = input_37_cast);
            tensor<int32, [1]> context_mask_11_axes_0 = const()[name = tensor<string, []>("context_mask_11_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1, 1, 3072, 1]> context_mask_11_cast = expand_dims(axes = context_mask_11_axes_0, x = context_mask_9_cast);
            tensor<bool, []> context_3_transpose_x_0 = const()[name = tensor<string, []>("context_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> context_3_transpose_y_0 = const()[name = tensor<string, []>("context_3_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 1, 80, 1]> context_3_cast = matmul(transpose_x = context_3_transpose_x_0, transpose_y = context_3_transpose_y_0, x = input_x_7_cast, y = context_mask_11_cast);
            tensor<int32, [4]> var_310 = const()[name = tensor<string, []>("op_310"), val = tensor<int32, [4]>([1, 80, 1, 1])];
            tensor<fp16, [1, 80, 1, 1]> input_39_cast = reshape(shape = var_310, x = context_3_cast);
            tensor<int32, [2]> var_317 = const()[name = tensor<string, []>("op_317"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_319 = const()[name = tensor<string, []>("op_319"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_41_pad_type_0 = const()[name = tensor<string, []>("input_41_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_41_pad_0 = const()[name = tensor<string, []>("input_41_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 80, 1, 1]> pose_model_backbone_layer1_1_attention_channel_add_conv_0_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_1_attention_channel_add_conv_0_weight_to_fp16"), val = tensor<fp16, [16, 80, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(91328)))];
            tensor<fp16, [16]> pose_model_backbone_layer1_1_attention_channel_add_conv_0_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_1_attention_channel_add_conv_0_bias_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(93952)))];
            tensor<fp16, [1, 16, 1, 1]> input_41_cast = conv(bias = pose_model_backbone_layer1_1_attention_channel_add_conv_0_bias_to_fp16, dilations = var_319, groups = var_133, pad = input_41_pad_0, pad_type = input_41_pad_type_0, strides = var_317, weight = pose_model_backbone_layer1_1_attention_channel_add_conv_0_weight_to_fp16, x = input_39_cast);
            tensor<int32, [3]> input_43_axes_0 = const()[name = tensor<string, []>("input_43_axes_0"), val = tensor<int32, [3]>([-3, -2, -1])];
            tensor<fp16, [16, 1, 1]> pose_model_backbone_layer1_1_attention_channel_add_conv_1_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_1_attention_channel_add_conv_1_weight_to_fp16"), val = tensor<fp16, [16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(94080)))];
            tensor<fp16, [16, 1, 1]> pose_model_backbone_layer1_1_attention_channel_add_conv_1_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_1_attention_channel_add_conv_1_bias_to_fp16"), val = tensor<fp16, [16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(94208)))];
            tensor<fp16, [1, 16, 1, 1]> input_43_cast = layer_norm(axes = input_43_axes_0, beta = pose_model_backbone_layer1_1_attention_channel_add_conv_1_bias_to_fp16, epsilon = var_138_to_fp16, gamma = pose_model_backbone_layer1_1_attention_channel_add_conv_1_weight_to_fp16, x = input_41_cast);
            tensor<fp16, [1, 16, 1, 1]> input_45_cast = relu(x = input_43_cast);
            tensor<int32, [2]> var_329 = const()[name = tensor<string, []>("op_329"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_331 = const()[name = tensor<string, []>("op_331"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> channel_add_term_3_pad_type_0 = const()[name = tensor<string, []>("channel_add_term_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> channel_add_term_3_pad_0 = const()[name = tensor<string, []>("channel_add_term_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [80, 16, 1, 1]> pose_model_backbone_layer1_1_attention_channel_add_conv_3_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_1_attention_channel_add_conv_3_weight_to_fp16"), val = tensor<fp16, [80, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(94336)))];
            tensor<fp16, [80]> pose_model_backbone_layer1_1_attention_channel_add_conv_3_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_1_attention_channel_add_conv_3_bias_to_fp16"), val = tensor<fp16, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(96960)))];
            tensor<fp16, [1, 80, 1, 1]> channel_add_term_3_cast = conv(bias = pose_model_backbone_layer1_1_attention_channel_add_conv_3_bias_to_fp16, dilations = var_331, groups = var_133, pad = channel_add_term_3_pad_0, pad_type = channel_add_term_3_pad_type_0, strides = var_329, weight = pose_model_backbone_layer1_1_attention_channel_add_conv_3_weight_to_fp16, x = input_45_cast);
            tensor<fp16, [1, 80, 64, 48]> out_3_cast = add(x = x_3_cast, y = channel_add_term_3_cast);
            tensor<fp16, [1, 80, 64, 48]> input_47_cast = add(x = out_3_cast, y = input_27_cast);
            tensor<fp16, [1, 80, 64, 48]> input_49_cast = relu(x = input_47_cast);
            tensor<int32, [2]> var_343 = const()[name = tensor<string, []>("op_343"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_345 = const()[name = tensor<string, []>("op_345"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_51_pad_type_0 = const()[name = tensor<string, []>("input_51_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_51_pad_0 = const()[name = tensor<string, []>("input_51_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [80, 80, 1, 1]> pose_model_backbone_layer1_2_conv1_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_2_conv1_weight_to_fp16"), val = tensor<fp16, [80, 80, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(97216)))];
            tensor<fp16, [80]> pose_model_backbone_layer1_2_conv1_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_2_conv1_bias_to_fp16"), val = tensor<fp16, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(110080)))];
            tensor<fp16, [1, 80, 64, 48]> input_51_cast = conv(bias = pose_model_backbone_layer1_2_conv1_bias_to_fp16, dilations = var_345, groups = var_133, pad = input_51_pad_0, pad_type = input_51_pad_type_0, strides = var_343, weight = pose_model_backbone_layer1_2_conv1_weight_to_fp16, x = input_49_cast);
            tensor<fp16, [1, 80, 64, 48]> input_53_cast = relu(x = input_51_cast);
            tensor<int32, [2]> var_351 = const()[name = tensor<string, []>("op_351"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_353 = const()[name = tensor<string, []>("op_353"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_55_pad_type_0 = const()[name = tensor<string, []>("input_55_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_55_pad_0 = const()[name = tensor<string, []>("input_55_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [80, 5, 3, 3]> pose_model_backbone_layer1_2_conv2_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_2_conv2_weight_to_fp16"), val = tensor<fp16, [80, 5, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(110336)))];
            tensor<fp16, [80]> pose_model_backbone_layer1_2_conv2_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_2_conv2_bias_to_fp16"), val = tensor<fp16, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(117632)))];
            tensor<fp16, [1, 80, 64, 48]> input_55_cast = conv(bias = pose_model_backbone_layer1_2_conv2_bias_to_fp16, dilations = var_353, groups = var_137, pad = input_55_pad_0, pad_type = input_55_pad_type_0, strides = var_351, weight = pose_model_backbone_layer1_2_conv2_weight_to_fp16, x = input_53_cast);
            tensor<fp16, [1, 80, 64, 48]> input_57_cast = relu(x = input_55_cast);
            tensor<int32, [2]> var_359 = const()[name = tensor<string, []>("op_359"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_361 = const()[name = tensor<string, []>("op_361"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_5_pad_type_0 = const()[name = tensor<string, []>("x_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_5_pad_0 = const()[name = tensor<string, []>("x_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [80, 80, 1, 1]> pose_model_backbone_layer1_2_conv3_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_2_conv3_weight_to_fp16"), val = tensor<fp16, [80, 80, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(117888)))];
            tensor<fp16, [80]> pose_model_backbone_layer1_2_conv3_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_2_conv3_bias_to_fp16"), val = tensor<fp16, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(130752)))];
            tensor<fp16, [1, 80, 64, 48]> x_5_cast = conv(bias = pose_model_backbone_layer1_2_conv3_bias_to_fp16, dilations = var_361, groups = var_133, pad = x_5_pad_0, pad_type = x_5_pad_type_0, strides = var_359, weight = pose_model_backbone_layer1_2_conv3_weight_to_fp16, x = input_57_cast);
            tensor<int32, [3]> var_374 = const()[name = tensor<string, []>("op_374"), val = tensor<int32, [3]>([1, 80, 3072])];
            tensor<fp16, [1, 80, 3072]> input_x_9_cast = reshape(shape = var_374, x = x_5_cast);
            tensor<int32, [1]> input_x_11_axes_0 = const()[name = tensor<string, []>("input_x_11_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 80, 3072]> input_x_11_cast = expand_dims(axes = input_x_11_axes_0, x = input_x_9_cast);
            tensor<int32, [2]> var_379 = const()[name = tensor<string, []>("op_379"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_381 = const()[name = tensor<string, []>("op_381"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> context_mask_13_pad_type_0 = const()[name = tensor<string, []>("context_mask_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> context_mask_13_pad_0 = const()[name = tensor<string, []>("context_mask_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1, 80, 1, 1]> pose_model_backbone_layer1_2_attention_conv_mask_weight_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_2_attention_conv_mask_weight_to_fp16"), val = tensor<fp16, [1, 80, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(131008)))];
            tensor<fp16, [1]> pose_model_backbone_layer1_2_attention_conv_mask_bias_to_fp16 = const()[name = tensor<string, []>("pose_model_backbone_layer1_2_attention_conv_mask_bias_to_fp16"), val = tensor<fp16, [1]>([-0x1.c8p-19])];
            tensor<fp16, [1, 1, 64, 48]> context_mask_13_cast = conv(bias = pose_model_backbone_layer1_2_attention_conv_mask_bias_to_fp16, dilations = var_381, groups = var_133, pad = context_mask_13_pad_0, pad_type = context_mask_13_pad_type_0, strides = var_379, weight = pose_model_backbone_layer1_2_attention_conv_mask_weight_to_fp16, x = x_5_cast);
